backend/controllers/ContentController.php

SELECT * FROM `co_content` WHERE `id`='1047'
---
    protected function findModel($id)
    {
        if (($model = Content::findOne($id)) !== null) {