backend/controllers/ContentCatlogController.php

INSERT INTO `co_content_catlog` (`catname`, `pid`) VALUES ('教育', 0)
---
    public function actionCreate()
    {
        $model = new ContentCatlog();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `co_content_catlog` WHERE `catid`='4'
---
    protected function findModel($id)
    {
        if (($model = ContentCatlog::findOne($id)) !== null) {