backend/controllers/VideoController.php

    protected function findModel($id)
    {
        if (($model = Video::findOne($id)) !== null) {
---
SELECT * FROM `co_video` WHERE `videoid`='5'