frontend/controllers/api/AdvertisementController.php

SELECT * FROM `co_advertisement` WHERE (`id`='18') AND (`status`=1)
---
    public function actionGet()
    {
        $id = Yii::$app->request->get('id');
        if (empty($id)) {
            $this->setReturn("0003", "failed", "", "参数错误");
            return;
        }

        $result = Advertisement::find()->where(['id' => $id, 'status' => 1])->asArray()->one();