backend/models/Menu.php

    static public function getMenuByid($parent = 0, $PermissionsByUser = []){
        if ($parent == 0) {
            $where = 'parent is null';
        }
        else {
            $where = ['parent'=> $parent];
        }
        $permissionMenu = [];
        $menuModel = new Menu();
        $menus = $menuModel->find()->where($where)->all();
        if (is_array($menus)) {
            foreach ($menus as $k => $v) {
                if (($one = $menuModel->find()->where(['parent' => $v['id']])->one()) !== null && !empty($menusReturn = self::getMenuByid($v['id'], $PermissionsByUser))) {
---
SELECT * FROM `co_menu` WHERE parent is null
SELECT * FROM `co_menu` WHERE `parent`=1