backend/models/User.php

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => self::STATUS_ACTIVE]);
---
SELECT * FROM `co_user` WHERE (`username`='huangbo') AND (`status`=10)

    public function save($runValidation = true, $attributeNames = null)
    {
        if ($this->password) {
            $this->generateAuthKey();
            $this->setPassword($this->password.$this->auth_key);
        }
        return parent::save($runValidation, $attributeNames); // TODO: Change the autogenerated stub
---
UPDATE `co_user` SET `end_login_ip`='127.0.0.1', `end_login_at`=1484119765, `updated_at`=1484119765 WHERE `id`=1